1s/ERP/Conf/Catalogs/Лико_ОригиналМакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ОригиналМакеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрСпец</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрОМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторФайла</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрСпец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрОМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ОригиналМакеты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте  
Перем ИмяФайлаИсточник;

&НаСервере	
Функция ПолучитьИмяФайла(ИмяКаталога, ИмяФайла) Экспорт

	Если Не ПустаяСтрока(ИмяФайла) Тогда
		
		Возврат ИмяКаталога + ?(Прав(ИмяКаталога, 1) = "\", "", "\") + ИмяФайла;	
		
	Иначе
		
		Возврат ИмяКаталога;
		
	КонецЕсли;

КонецФункции 

&НаСервере
Функция РазобратьСтроку(_Строка, _Разделитель, _УдалятьПустые = Истина)
	Результат = Новый СписокЗначений;
	_т = СтрЗаменить(_Строка, _Разделитель, Символы.ПС);
	
	Для Строк = 1 по СтрЧислоСтрок(_т) Цикл
		Если СтрДлина(СтрПолучитьСтроку(_т, Строк)) > 0 ИЛИ не _УдалятьПустые Тогда
			Результат.Добавить(СтрПолучитьСтроку(_т, Строк));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЗначениеВСтрокуВнутрНаСервере(Значение)
	возврат  ЗначениеВСтрокуВнутр(Значение)
КонецФункции	


&НаКлиенте
Процедура ДобавитьКартинкуВSQL(стр)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.Фильтр = "(*.*)|*.*";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл оригинал-макета";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПараметрыСоединения =  Лико_ДополнительноКлиент.УстановитьСоединениеССервером();

		Подключение = ПараметрыСоединения.ADOConnection;
		ИмяТаблицы = "FileStore";
		Замещать = Истина;
		ИмяФайла = СокрЛП(ДиалогОткрытияФайла.ВыбранныеФайлы[0]);
		
		ИДСсылки = ЗначениеВСтрокуВнутрНаСервере(Объект.ссылка);
		ИДСсылкиМакета = ЗначениеВСтрокуВнутрНаСервере(стр.идентификаторфайла);

		Stream = Новый COMОбъект("ADODB.Stream");
		Stream.Type = 1;
		Stream.Open();
		Stream.LoadFromFile(ИмяФайла);
		
		RecordSet = Новый COMОбъект("ADODB.RecordSet");
		RecordSet.CursorLocation = 3;
		RecordSet.LockType = 2;
		
		Имяр = РазобратьСтроку(ИмяФайла, "\");
		Имяр = Имяр[Имяр.Количество() - 1].Значение;
		
		//Запрос = "select [GUID], [GUIDMaket],[Data], [FileName], [UserName], [DateTime] from [" + ИмяТаблицы + "] where [GUID]='" + ИДСсылки + "' AND [GUIDMaket]='" +ИДСсылкиМакета + "'";
		Запрос = "select [GUID],[GUIDMaket], [GUIDOM], [GUIDRow],[Data], [FileName], [UserName], [DateTime] from [" + ИмяТаблицы + "] where [GUIDOM]='" + ИДСсылки + "' AND [GUIDRow]='" +ИДСсылкиМакета + "'";

		
		Попытка		
			RecordSet.Open(Запрос, Подключение );
		Исключение	
			Сообщить("Ошибка выполнения SQL запроса (" + ОписаниеОшибки() + ")", СтатусСообщения.ОченьВажное);	
			Возврат ;
		КонецПопытки;
		
		Если RecordSet.RecordCount > 0 И Замещать = Ложь Тогда
			RecordSet.AddNew();
			Имяр = Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy hh-mm-ss'") + " " + Имяр;
		ИначеЕсли RecordSet.RecordCount = 0 Тогда
			RecordSet.AddNew();
		Иначе		
			RecordSet.MoveFirst();
		КонецЕсли;
		
		RecordSet.Fields("Data").Value = Stream.Read(-1);
		RecordSet.Fields("GUID").Value = ИДСсылки;
		RecordSet.Fields("GUIDOM").Value = ИДСсылки;
		RecordSet.Fields("GUIDRow").Value = ИДСсылкиМакета;
		RecordSet.Fields("GUIDMaket").Value = ИДСсылкиМакета;
		RecordSet.Fields("FileName").Value = Имяр;
		RecordSet.Fields("UserName").Value = СокрЛП(Строка(ПользователиКлиентСервер.ТекущийПользователь()));
		RecordSet.Fields("DateTime").Value = ТекущаяДата();
		RecordSet.Update();	
		
		Stream.Close();
		RecordSet.Close();
		стр.ИмяФайла  = СтрЗаменить(ДиалогОткрытияФайла.ПолноеИмяФайла,ДиалогОткрытияФайла.Каталог, "");
		Лико_ДополнительноКлиент.ЗакрытьСоединениеССервером(ПараметрыСоединения);
		//АдресКартинки=ПоместитьВоВременноеХранилище(Новый Картинка(ИмяФайла, Истина), УникальныйИдентификатор);
   		этаформа.Записать();
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	Если Не значениеЗаполнено(Объект.Ссылка) Тогда 
		Сообщить("Сначала нужно записать элемент!");
		Возврат;
	КонецЕсли;
	текстр = Объект.Файлы.Добавить();
	текстр.идентификаторфайла = Новый УникальныйИдентификатор;
	ДобавитьКартинкуВSQL(текстр);
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	текстр= Элементы.Файлы.ТекущиеДанные;
	ДобавитьКартинкуВSQL(текстр);
КонецПроцедуры


&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	текстр = Элементы.Файлы.ТекущиеДанные;
	Если текстр <> Неопределено Тогда 
		ПоказатьКартинку();
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьКартинку21112019()
	текстр= Элементы.Файлы.ТекущиеДанные;
	
	//Элементы.ОсновноеИзображение.РазмерКартинки=РазмерКартинки.Растянуть;
	
	ПараметрыСоединения =   Лико_ДополнительноКлиент.УстановитьСоединениеССервером();
	Подключение = ПараметрыСоединения.ADOConnection;
	
	Если Подключение = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("Отсутствует подключение к SQL серверу! Обратитесь, пожалуйста, в IT - отдел.");
		#КонецЕсли	
		Возврат;
	КонецЕсли;
	
	Файл = Неопределено;
	ИмяТаблицы = "FileStore";
	Замещать = Истина;
	
	ИДСсылки = ЗначениеВСтрокуВнутрНаСервере(Объект.Ссылка);
	ИДСсылкиМакета = ЗначениеВСтрокуВнутрНаСервере(текстр.ИдентификаторФайла);
	
	
	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();
	
	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.CursorLocation = 3;
	RecordSet.LockType = 2;
	
	//Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUID = '" + ИДСсылки + "' AND GUIDMaket  = '" + ИДСсылкиМакета + "'";
	Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUIDOM = '" + ИДСсылки + "' AND GUIDRow  = '" + ИДСсылкиМакета + "'";

	RecordSet.Open(Запрос,Подключение);
	
	
	Если RecordSet.RecordCount > 0 Тогда
		//Попытка
		RecordSet.MoveFirst();
		Stream.Write(RecordSet.Fields("Data").Value);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Stream.SaveToFile(ИмяВременногоФайла);
		
		Stream.Close();
		RecordSet.Close();
		Файл = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Если Файл<> Неопределено Тогда
			//Попытка
				ЕСли ИмяФайлаИсточник=текстр.имяфайла Тогда
					Возврат;
				КонецЕсли;
				
				HTML=Неопределено;
				ИмяФайлаИсточник	=текстр.имяфайла;
				ИмяФайла			=Неопределено;
				Расширение			=Неопределено;
				
				ПолучитьИмяРасширение(ИмяФайлаИсточник, ИмяФайла,Расширение);
				
				Если ВРег(Расширение)="PDF" Тогда
					Элементы.PDF.Видимость		=Истина;
					Элементы.PDF.Доступность=Ложь;
					Элементы.JPG.Видимость	=Ложь;
					HTML=ИмяВременногоФайла;

					
					
					//ИмяКаталога = КаталогВременныхФайлов();
					//ИмяФайла = "vrem" ;
					////Попытка
					//	ИмяФайла = ПолучитьИмяФайла(ИмяКаталога, ИмяФайла);
					//	Файл.Записать(ИмяФайла);
					//	HTML=ИмяФайла;
						
					//Исключение
					//	
					//КонецПопытки;
					
					
				Иначе
					
					Элементы.PDF.Видимость		=Ложь;
					Элементы.JPG.Видимость	=Истина;
					
					//Преобразуем картинку, чтобы быстрее отображалась
					НоваяКартинка = Новый Картинка(ИмяВременногоФайла);
					ПреобразованнаяКартинка = НоваяКартинка.Преобразовать(ФорматКартинки.PNG);
					ИмяВременногоФайлаПреобразованнойКартинки = ПолучитьИмяВременногоФайла();
					ПреобразованнаяКартинка.Записать(ИмяВременногоФайлаПреобразованнойКартинки );
					АдресКартинки=ПоместитьВоВременноеХранилище(Новый Картинка(ИмяВременногоФайлаПреобразованнойКартинки, Истина), УникальныйИдентификатор);
					
				КонецЕсли;
				
			//Исключение
			//	//ОписаниеОшибки()
			//КонецПопытки;
			
			//УдалитьФайлы(ИмяВременногоФайла);
		Иначе
				АдресКартинки="";
			КонецЕсли;
		КонецЕсли;	
	
	Лико_ДополнительноКлиент.ЗакрытьСоединениеССервером(ПараметрыСоединения);	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартинку()
	текстр= Элементы.Файлы.ТекущиеДанные;

	//Элементы.ОсновноеИзображение.РазмерКартинки=РазмерКартинки.Растянуть;

	ПараметрыСоединения =   Лико_ДополнительноКлиент.УстановитьСоединениеССервером();
	Подключение = ПараметрыСоединения.ADOConnection;

	Если Подключение = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("Отсутствует подключение к SQL серверу! Обратитесь, пожалуйста, в IT - отдел.");
		#КонецЕсли	
		Возврат;
	КонецЕсли;

	Файл = Неопределено;
	ИмяТаблицы = "FileStore";
	Замещать = Истина;

	ИДСсылки = ЗначениеВСтрокуВнутрНаСервере(Объект.Ссылка);
	ИДСсылкиМакета = ЗначениеВСтрокуВнутрНаСервере(текстр.ИдентификаторФайла);


	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();

	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.CursorLocation = 3;
	RecordSet.LockType = 2;

	//Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUID = '" + ИДСсылки + "' AND GUIDMaket  = '" + ИДСсылкиМакета + "'";
	Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUIDOM = '" + ИДСсылки + "' AND GUIDRow  = '" + ИДСсылкиМакета + "'";

	RecordSet.Open(Запрос,Подключение);


	Если RecordSet.RecordCount > 0 Тогда
		//Попытка
		RecordSet.MoveFirst();
		Stream.Write(RecordSet.Fields("Data").Value);

		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Stream.SaveToFile(ИмяВременногоФайла);

		Stream.Close();
		RecordSet.Close();
		Файл = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Если Файл<> Неопределено Тогда
			//Попытка
			ЕСли ИмяФайлаИсточник=текстр.имяфайла Тогда
				Возврат;
			КонецЕсли;

			HTML=Неопределено;
			ИмяФайлаИсточник	=текстр.имяфайла;
			ИмяФайла			=Неопределено;
			Расширение			=Неопределено;

			ПолучитьИмяРасширение(ИмяФайлаИсточник, ИмяФайла,Расширение);

			Если ВРег(Расширение)="PDF" Тогда
				Элементы.PDF.Видимость		=Истина;
				//Элементы.PDF.Доступность=Ложь;
				Элементы.JPG.Видимость	=Ложь;
				ПутьКФайлу=ИмяВременногоФайла;
				ПутьКФайлу=СтрЗаменить(ПутьКФайлу,"\\okil\","");
			ПутьКФайлу=СтрЗаменить(ПутьКФайлу,"\","/");

			HTML = HttpАдресПросмотраPDF + ПутьКФайлу;

				//HTML=ИмяВременногоФайла;



				//ИмяКаталога = КаталогВременныхФайлов();
				//ИмяФайла = "vrem" ;
				////Попытка
				//	ИмяФайла = ПолучитьИмяФайла(ИмяКаталога, ИмяФайла);
				//	Файл.Записать(ИмяФайла);
				//	HTML=ИмяФайла;

				//Исключение
				//	
				//КонецПопытки;


			Иначе

				Элементы.PDF.Видимость		=Ложь;
				Элементы.JPG.Видимость	=Истина;

				//Преобразуем картинку, чтобы быстрее отображалась
				НоваяКартинка = Новый Картинка(ИмяВременногоФайла);
				ПреобразованнаяКартинка = НоваяКартинка.Преобразовать(ФорматКартинки.PNG);
				ИмяВременногоФайлаПреобразованнойКартинки = ПолучитьИмяВременногоФайла();
				ПреобразованнаяКартинка.Записать(ИмяВременногоФайлаПреобразованнойКартинки );
				АдресКартинки=ПоместитьВоВременноеХранилище(Новый Картинка(ИмяВременногоФайлаПреобразованнойКартинки, Истина), УникальныйИдентификатор);

			КонецЕсли;

			//Исключение
			//	//ОписаниеОшибки()
			//КонецПопытки;

			//УдалитьФайлы(ИмяВременногоФайла);
		Иначе
			АдресКартинки="";
		КонецЕсли;
	КонецЕсли;	

	Лико_ДополнительноКлиент.ЗакрытьСоединениеССервером(ПараметрыСоединения);	
КонецПроцедуры




&НаКлиенте
Процедура ПросмотрКартинки()
	Попытка
		ЕСли ИмяФайлаИсточник=Адрескартинки Тогда
			Возврат;
		КонецЕсли;
		
		HTML=Неопределено;
		ИмяФайлаИсточник	=Адрескартинки;
		ИмяФайла			=Неопределено;
		Расширение			=Неопределено;
		
		ПолучитьИмяРасширение(ИмяФайлаИсточник, ИмяФайла,Расширение);
		
		Если ВРег(Расширение)="PDF" Тогда
			Элементы.PDF.Видимость		=Истина;
			Элементы.JPG.Видимость	=Ложь;
			HTML=Адрескартинки;
			
		Иначе
			
			Элементы.PDF.Видимость		=Ложь;
			Элементы.JPG.Видимость	=Истина;
			
			ЕстьСкан = ЗначениеЗаполнено(ИмяФайлаИсточник);
			Если ЕстьСкан Тогда
				/// Проверяем физическое наличие скана
				Фл = Новый Файл(ИмяФайлаИсточник);
				Если Не Фл.Существует() Тогда
					ЕстьСкан = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьСкан Тогда
				Картинка = Новый Картинка(ИмяФайлаИсточник); 
				Предпросмотр = ПоместитьВоВременноеХранилище(Картинка, ЭтаФорма.УникальныйИдентификатор);
			Иначе
				Предпросмотр = "";
			КонецЕсли; 	
		КонецЕсли;
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
	
КонецПроцедуры


// Процедура разделяет имя и расширение файла
&НаКлиенте 
Процедура ПолучитьИмяРасширение(ИмяРасширение, Имя, Расширение) Экспорт
	МассивЧастей = РазложитьСтрокуВМассивПодстрок(ИмяРасширение, ".");
	Если МассивЧастей.Количество()=0 Тогда
		Имя = "";
		Расширение = "";
	Иначе
		Имя = "";
		Для й=0 По МассивЧастей.Количество()-2 Цикл
			Имя = Имя+?(й=0,"",".")+МассивЧастей[й];
		КонецЦикла;
		Расширение = МассивЧастей[МассивЧастей.Количество()-1];
	КонецЕсли;
КонецПроцедуры

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     - если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые строки;
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  РазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
&НаКлиенте  
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 


&НаКлиенте
Процедура Сохранить(Команда)
	текстр= Элементы.Файлы.ТекущиеДанные;

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок = "Укажите имя файла";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.Расширение = "*";
	ДиалогВыбораФайла.ПолноеИмяФайла = текстр.имяфайла;
	
	// Сохранить файл на диске
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПараметрыСоединения = Лико_ДополнительноКлиент.УстановитьСоединениеССервером();
		Подключение = ПараметрыСоединения.ADOConnection;

	Если Подключение = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("Отсутствует подключение к SQL серверу! Обратитесь, пожалуйста, в IT - отдел.");
		#КонецЕсли	
		Возврат;
	КонецЕсли;
	
	Файл = Неопределено;
	ИмяТаблицы = "FileStore";
	Замещать = Истина;
	
	ИДСсылки = ЗначениеВСтрокуВнутрНаСервере(Объект.Ссылка);
	ИДСсылкиМакета = ЗначениеВСтрокуВнутрНаСервере(текстр.ИдентификаторФайла);

	
	Stream = Новый COMОбъект("ADODB.Stream");
	Stream.Type = 1;
	Stream.Open();
	
	RecordSet = Новый COMОбъект("ADODB.RecordSet");
	RecordSet.CursorLocation = 3;
	RecordSet.LockType = 2;
	
	//Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUID = '" + ИДСсылки + "' AND GUIDMaket  = '" + ИДСсылкиМакета + "'";
	Запрос = "SELECT Data FROM [" + ИмяТаблицы + "] WHERE GUIDOM = '" + ИДСсылки + "' AND GUIDRow  = '" + ИДСсылкиМакета + "'";

	RecordSet.Open(Запрос,Подключение);
	
	//Попытка
		RecordSet.MoveFirst();
		Stream.Write(RecordSet.Fields("Data").Value);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Stream.SaveToFile(ИмяВременногоФайла);

		Stream.Close();
		RecordSet.Close();
		Файл = Новый ДвоичныеДанные(ИмяВременногоФайла);
		УдалитьФайлы(ИмяВременногоФайла);

		//Возврат Файл;
		Если Файл<> Неопределено Тогда
			Файл.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);	
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	текстр= Элементы.Файлы.ТекущиеДанные;
	ПараметрыСоединения = Лико_ДополнительноКлиент.УстановитьСоединениеССервером();
	Подключение = ПараметрыСоединения.ADOConnection;
	ИмяТаблицы = "FileStore";
	
	Если Подключение = Неопределено Тогда
		#Если Клиент Тогда
			Предупреждение("Вначале необходимо подключиться к серверу SQL!");
		#КонецЕсли	
		Возврат ;
	КонецЕсли;
	Файл = Неопределено;
	ИДСсылки = ЗначениеВСтрокуВнутрНаСервере(Объект.Ссылка);
	ИДСсылкиМакета = ЗначениеВСтрокуВнутрНаСервере(текстр.ИдентификаторФайла);


	Command = Новый COMОбъект("ADODB.Command");
	Command.ActiveConnection = Подключение;
	Command.CommandType = 1;
	//Command.CommandText = "DELETE FROM [" + ИмяТаблицы + "] WHERE GUID = '" + ИДСсылки + "' AND GUIDMaket  = '" + ИДСсылкиМакета + "'";
	Command.CommandText = "DELETE FROM [" + ИмяТаблицы + "] WHERE GUIDOM = '" + ИДСсылки + "' AND GUIDRow  = '" + ИДСсылкиМакета + "'";

	Попытка		Command.Execute();
	Исключение		
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Сообщить("Файл удален из базы данных оригинал-макетов");
	//НайденныеСтроки = Объект.Файлы.НайтиСтроки(Новый Структура("НомерСтроки", текстр.номерстроки));	
	//Для Каждого Строка из НайденныеСтроки Цикл	
	//	Объект.Файлы.Удалить(Строка);		
	//КонецЦикла;
	Объект.Файлы.Удалить(Объект.Файлы[текстр.номерстроки-1]);
	АдресКартинки="";

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	HttpАдресПросмотраPDF = Справочники.Лико_ПредопределенныеЗначения.HttpАдресПросмотраPDF.ЗначениеПараметра;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если не ЗначениеЗаполнено(ТекущийОбъект.ссылка) или  не Модифицированность Тогда 
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Ссылка.Площадка КАК Площадка,
		|	ЗаказКлиентаТовары.Ссылка.НомерБезПрефикса КАК НомерБезПрефикса
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.ОригиналМакет = &ОригиналМакет
		|	И ЗаказКлиентаТовары.Ссылка.ДатаОтправкиВРаботу <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("ОригиналМакет", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ЕстьЗаказыВПечати = Ложь;  
	СтрокаЗаказы = "";
	
	Пока Выборка.Следующий() Цикл  
		
		Если Лико_Планирование.ЕстьЭтапыНеДоПечати(Выборка.Ссылка) Тогда   			
			//ЕстьЗаказыВПечати = Истина;
			//СтрокаЗаказы = Выборка.НомерБезПрефикса + символы.ПС;						
		Иначе 
			ЗаказОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаказОбъект.Версия = ЗаказОбъект.Версия + 1;
			ЗаказОбъект.ДатаОтправкиВРаботу = ТекущаяДата();
			
			НомерВерсии = 0;
			для каждого стр из ЗаказОбъект.ПричиныЗамены цикл
				НомерВерсии = Макс(НомерВерсии, стр.НомерВерсии); 
			конеццикла; 
			
			НомерВерсии = НомерВерсии + 1;
			
			
			НовСтрПричиныЗамены = ЗаказОбъект.ПричиныЗамены.Добавить();
			НовСтрПричиныЗамены.ПричинаЗамены = Справочники.Лико_ПричиныЗамены.Макет;  
			НовСтрПричиныЗамены.НомерВерсии = НомерВерсии; 
			НовСтрПричиныЗамены.Комментарий = "Замена ОМ. Создан автоматически";  
			НовСтрПричиныЗамены.Автор = ПользователиКлиентСервер.ТекущийПользователь();  
			НовСтрПричиныЗамены.Дата = ТекущаяДата(); 
			
			Попытка
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись,); 
				
				Лико_Планирование.ПеренестиЗаказ(Выборка.Ссылка, Справочники.Лико_ЭтапыВыполненияЗаказа.ОПП,,,,,Истина); 
				
				Если Выборка.Площадка = Справочники.Лико_Площадки.Ликофлекс Тогда 
					СписокПолучателей = "OPP@okil-sato.ru";				
					Лико_Планирование.ОтправитьПисьмо("", СтрШаблон( "оригинал макет обновлен, версия поднята в заказе %1", Выборка.Ссылка ), СписокПолучателей);   
				КонецЕсли;
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;  
			
		КонецЕсли;    
		
			
	КонецЦикла; 

	
	
КонецПроцедуры
